In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("data.csv")

In [3]:
df

  Student  Subject  Marks
0   Harry  english     45
1   Vinod  english     45
2    Josh  Science     89
3   kumar      evs    100

In [6]:
df=df[df["Marks"]>50]

In [7]:
df

  Student  Subject  Marks
2    Josh  Science     89
3   kumar      evs    100

In [8]:
df.to_csv("output.csv")